Rechnerubung/Week1/Aufgabe1/RANS/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    
    cyclic 
    {
        type            cyclic;
    }
    wall
    {
        type            kLowReWallFunction;
        //type            kqRWallFunction;
        value           uniform 0.00375;
//        type            fixedValue;
//        value           uniform 0;      
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
