Rechnerubung/Week1/Aufgabe1/RANS/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    cyclic 
    {
        type            cyclic;
    }
    wall
    {
        type            nutLowReWallFunction;
//        type            nutkWallFunction;
//        value           uniform 0;
//        type            fixedValue;
        value           uniform 0;      

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
